; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v4 ?v2)
             (pred_2 ?v1 ?v11)
             (pred_6 ?v4 ?v11)
             (pred_8 ?v12 ?v4 )
	     (pred_4 ?v4)
             (pred_1 ?v10)
             (pred_3 ?v1)
             (pred_7 ?v11)
             (pred_10 ?v4)
             (pred_5 ?v1)
             (pred_9 ?v4)
             (pred_12 ))



(:action op_2
:parameters (?v3 ?v7 ?v9 ?v13)
:precondition (and (pred_1 ?v3) (pred_1 ?v7) (pred_3 ?v9) (pred_7 ?v13)
          (pred_11 ?v3 ?v7) (pred_2 ?v9 ?v13)
                   (pred_6 ?v7 ?v13) (pred_4 ?v3) 
                   (pred_10 ?v7) (pred_5 ?v9))
:effect (and  (pred_9 ?v7) (not (pred_10 ?v7))))


(:action op_5
:parameters (?v3 ?v6)
:precondition (and (pred_1 ?v3) (pred_1 ?v6)
               (pred_4 ?v3) (pred_11 ?v3 ?v6) (pred_9 ?v6))
:effect (and (pred_4 ?v6) (not (pred_4 ?v3))))

(:action op_1
:parameters (?v3 ?v9)
:precondition (and (pred_1 ?v3) (pred_3 ?v9) 
                  (pred_4 ?v3) (pred_8 ?v9 ?v3) (pred_12 ))
:effect (and (pred_5 ?v9)
   (not (pred_8 ?v9 ?v3)) (not (pred_12 ))))


(:action op_4
:parameters (?v3 ?v8 ?v5)
:precondition (and (pred_1 ?v3) (pred_3 ?v8) (pred_3 ?v5)
                  (pred_4 ?v3) (pred_5 ?v5) (pred_8 ?v8 ?v3))
:effect (and (pred_5 ?v8) (pred_8 ?v5 ?v3)
        (not (pred_5 ?v5)) (not (pred_8 ?v8 ?v3))))

(:action op_3
:parameters (?v3 ?v9)
:precondition (and (pred_1 ?v3) (pred_3 ?v9) 
                  (pred_4 ?v3) (pred_5 ?v9))
:effect (and (pred_12 ) (pred_8 ?v9 ?v3) (not (pred_5 ?v9)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_10 obj_28 obj_22 obj_11 obj_15 obj_18 obj_27 obj_06 obj_17 obj_26 obj_05 obj_20 obj_01 obj_21 obj_23 obj_08 obj_09 obj_07 obj_29 obj_25 obj_16 obj_14 obj_13 obj_12
    obj_19 obj_03
    obj_02 obj_24 obj_30
    )

    (:init
       (pred_12)

       (pred_1 obj_04)
       (pred_1 obj_10)
       (pred_1 obj_28)
       (pred_1 obj_22)
       (pred_1 obj_11)
       (pred_1 obj_15)
       (pred_1 obj_18)
       (pred_1 obj_27)
       (pred_1 obj_06)
       (pred_1 obj_17)
       (pred_1 obj_26)
       (pred_1 obj_05)
       (pred_1 obj_20)
       (pred_1 obj_01)
       (pred_1 obj_21)
       (pred_1 obj_23)
       (pred_1 obj_08)
       (pred_1 obj_09)
       (pred_1 obj_07)
       (pred_1 obj_29)
       (pred_1 obj_25)
       (pred_1 obj_16)
       (pred_1 obj_14)
       (pred_1 obj_13)
       (pred_1 obj_12)
       (pred_7 obj_19)
       (pred_7 obj_03)
       (pred_3 obj_02)
       (pred_3 obj_24)
       (pred_3 obj_30)

       (pred_11 obj_04 obj_15)
       (pred_11 obj_04 obj_10)
       (pred_11 obj_10 obj_18)
       (pred_11 obj_10 obj_28)
       (pred_11 obj_10 obj_04)
       (pred_11 obj_28 obj_27)
       (pred_11 obj_28 obj_22)
       (pred_11 obj_28 obj_10)
       (pred_11 obj_22 obj_06)
       (pred_11 obj_22 obj_11)
       (pred_11 obj_22 obj_28)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_11 obj_22)
       (pred_11 obj_15 obj_26)
       (pred_11 obj_15 obj_18)
       (pred_11 obj_15 obj_04)
       (pred_11 obj_18 obj_05)
       (pred_11 obj_18 obj_27)
       (pred_11 obj_18 obj_10)
       (pred_11 obj_18 obj_15)
       (pred_11 obj_27 obj_20)
       (pred_11 obj_27 obj_06)
       (pred_11 obj_27 obj_28)
       (pred_11 obj_27 obj_18)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_06 obj_17)
       (pred_11 obj_06 obj_22)
       (pred_11 obj_06 obj_27)
       (pred_11 obj_17 obj_21)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_06)
       (pred_11 obj_26 obj_23)
       (pred_11 obj_26 obj_05)
       (pred_11 obj_26 obj_15)
       (pred_11 obj_05 obj_08)
       (pred_11 obj_05 obj_20)
       (pred_11 obj_05 obj_18)
       (pred_11 obj_05 obj_26)
       (pred_11 obj_20 obj_09)
       (pred_11 obj_20 obj_01)
       (pred_11 obj_20 obj_27)
       (pred_11 obj_20 obj_05)
       (pred_11 obj_01 obj_07)
       (pred_11 obj_01 obj_21)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_01 obj_20)
       (pred_11 obj_21 obj_29)
       (pred_11 obj_21 obj_17)
       (pred_11 obj_21 obj_01)
       (pred_11 obj_23 obj_25)
       (pred_11 obj_23 obj_08)
       (pred_11 obj_23 obj_26)
       (pred_11 obj_08 obj_16)
       (pred_11 obj_08 obj_09)
       (pred_11 obj_08 obj_05)
       (pred_11 obj_08 obj_23)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_09 obj_07)
       (pred_11 obj_09 obj_20)
       (pred_11 obj_09 obj_08)
       (pred_11 obj_07 obj_13)
       (pred_11 obj_07 obj_29)
       (pred_11 obj_07 obj_01)
       (pred_11 obj_07 obj_09)
       (pred_11 obj_29 obj_12)
       (pred_11 obj_29 obj_21)
       (pred_11 obj_29 obj_07)
       (pred_11 obj_25 obj_16)
       (pred_11 obj_25 obj_23)
       (pred_11 obj_16 obj_14)
       (pred_11 obj_16 obj_08)
       (pred_11 obj_16 obj_25)
       (pred_11 obj_14 obj_13)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_14 obj_16)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_13 obj_07)
       (pred_11 obj_13 obj_14)
       (pred_11 obj_12 obj_29)
       (pred_11 obj_12 obj_13)
       (pred_10 obj_04)
       (pred_10 obj_28)
       (pred_10 obj_23)
       (pred_6  obj_04 obj_19)
       (pred_6  obj_28 obj_03)
       (pred_6  obj_23 obj_03)
       (pred_9 obj_10)
       (pred_9 obj_22)
       (pred_9 obj_11)
       (pred_9 obj_15)
       (pred_9 obj_18)
       (pred_9 obj_27)
       (pred_9 obj_06)
       (pred_9 obj_17)
       (pred_9 obj_26)
       (pred_9 obj_05)
       (pred_9 obj_20)
       (pred_9 obj_01)
       (pred_9 obj_21)
       (pred_9 obj_08)
       (pred_9 obj_09)
       (pred_9 obj_07)
       (pred_9 obj_29)
       (pred_9 obj_25)
       (pred_9 obj_16)
       (pred_9 obj_14)
       (pred_9 obj_13)
       (pred_9 obj_12)

       (pred_2  obj_02 obj_19)
       (pred_2  obj_24 obj_03)
       (pred_2  obj_30 obj_19)
       (pred_8 obj_02 obj_05)
       (pred_8 obj_24 obj_10)
       (pred_8 obj_30 obj_07)
       (pred_4 obj_14)
    )

    (:goal (and
       (pred_8 obj_02 obj_18)
    ))
(:constraints
  (always (not (pred_4 obj_09)))
)
)

; plan
1. (op_5 obj_14 obj_16)
   deleted: (pred_4 obj_14)
   added: (pred_4 obj_16)
   goals met: 0 of 1
2. (op_5 obj_16 obj_08)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_08)
   goals met: 0 of 1
3. (op_5 obj_08 obj_05)
   deleted: (pred_4 obj_08)
   added: (pred_4 obj_05)
   goals met: 0 of 1
4. (op_1 obj_05 obj_02)
   deleted: (pred_8 obj_02 obj_05) (pred_12)
   added: (pred_5 obj_02)
   goals met: 0 of 1
5. (op_5 obj_05 obj_18)
   deleted: (pred_4 obj_05)
   added: (pred_4 obj_18)
   goals met: 0 of 1
6. (op_3 obj_18 obj_02)
   deleted: (pred_5 obj_02)
   added: (pred_12) (pred_8 obj_02 obj_18)
   goals met: 1 of 1
